module.exports = {
    "Email": "email",
    "Welcome back, %s!": "欢迎回来，%s!",                      // ctx.__('Welcome back, %s!', 'Shawn');
    "Hello {0}! My name is {1}.": "你好 {0}! 我的名字叫 {1}。", // ctx.__('Hello {0}! My name is {1}.', ['foo', 'bar'])



/*********************************************************** errcode ==> errmsg  start ***********************************************************/
  0: "success",
  "-1": "fail",

  // 10000 权限错误

  // 20000

  // 30000 用户输入错误

  // 40000 用户侧导致的请求错误
  40000: '参数缺失',
  40001: '参数有误',
  41004: '请求路径不存在',


  // cms
  46000: 'no permission, %s',
  46001: '没有token',
  46002: 'token登录过期',
  46003: '没有超级管理员权限',
  46004: '资源不存在',
  46005: '登录重试',
  46007: '非法请求',
  46008: '请求超时，请稍后再试',
  46009: '登录异常，请稍后再试',
  46010: '此活动以结束，只有超级管理员可编辑',
  46011: '此日期的资源已存在',
  46012: '资源已使用，不能删除',
  46013: '使用此分组的活动专栏的发布日期不在此范围内，与要更新的时间不符，不能更新时间',
  46014: '使用此分组的运营专栏的发布日期不在此范围内，与要更新的时间不符，不能更新时间',
  46200: 'appid不正确',
  46201: '暗号错误',
  46202: '此身份下的此日期的专栏已存在',
  46203: '您的角色在此专栏下最多创建两条首次推送',
  46204: '您的角色在此专栏下最多创建三条首次推送',
  46205: '解析链接失败',
  46206: '没有运营管理员或者超级管理员的权限',
  46207: '没有开发人员的权限',
  46300: '留言已经回复过了',

  // 50000 第三方错误
  50000: '系统发生了错误',	// 笼统的微信侧返回的错误

  60000: '系统错误',
  61010: '查询失败',
  61999: '系统发生了错误',	// 笼统的数据库操作错误
/*********************************************************** errcode ==> errmsg end ***********************************************************/

};
